{
  "basics": {
    "name": "Amirsina Torfi",
    "label": "Machine Learning Engineer",
    "image": "img/prof_pic.jpg",
    "email": "amirsina{dot}torfi{at}gmail{dot}com",
    "phone": "",
    "url": "https://astorfi.github.io",
    "summary": "Accomplished Machine Learning Engineer specializing in Generative AI, NLP, and Computer Vision with over 8 years of experience in the field, including roles at Meta, Nike, and Huma AI.",
    "location": {
      "address": "Reston",
      "postalCode": "",
      "city": "VA",
      "countryCode": "US",
      "region": "Virginia"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "astorfi",
        "url": "https://github.com/astorfi"
      },
      {
        "network": "LinkedIn",
        "username": "sinalk",
        "url": "https://www.linkedin.com/in/sinalk"
      },
      {
        "network": "Google Scholar",
        "username": "Amirsina Torfi",
        "url": "https://scholar.google.com/citations?user=2wkpsVwAAAAJ&hl=en"
      },
      {
        "network": "Medium",
        "username": "Machine Learning Mindset",
        "url": "https://medium.com/machine-learning-mindset"
      },
      {
        "network": "Portfolio",
        "username": "Project Portfolio",
        "url": "https://portfolium.com/astorfi/portfolio"
      }
    ]
  },
  "work": [
    {
      "name": "Nike",
      "position": "Lead Machine Learning Engineer - Tech Lead",
      "url": "",
      "startDate": "2024-05-01",
      "endDate": "",
      "summary": "Directing the development of advanced machine learning systems to revolutionize personalized consumer experiences, accelerate generative design processes, and enable precise human motion tracking. Focused on integrating AI into Nike's design, testing, and consumer engagement initiatives to drive innovation and optimize operational efficiency.",
      "highlights": [
        "Reduced prototyping time by 50% by developing generative AI models utilizing GANs, Diffusion Models, and Neural Style Transfer, empowering designers to quickly create and iterate on innovative product concepts aligned with brand aesthetics and consumer preferences.",
        "Led the engineering of multi-view 3D reconstruction pipelines using voxel-based autoencoders, Neural Radiance Fields (NeRFs), and point cloud processing, enabling the creation of high-fidelity digital twins for virtual try-ons and precise 3D product modeling.",
        "Developed and deployed Vision Transformer (ViT) networks for accurate real-time segmentation, detection, and classification of apparel and footwear in retail environments, reducing out-of-stock occurrences by 20% through effective inventory tracking.",
        "Pioneered human motion tracking and pose estimation models using 3D convolutional networks, optical flow, and temporal attention mechanisms, enhancing athlete product testing and biomechanics analysis to optimize footwear ergonomics and performance.",
        "Implemented AI-driven personalization systems combining generative AI and recommendation algorithms, enabling on-demand generation of personalized footwear designs based on individual style and fit preferences using large-scale, multi-modal consumer datasets.",
        "Optimized cross-functional collaboration by aligning machine learning research with design and consumer insights teams, ensuring AI solutions are both technically robust and strategically aligned with consumer experience goals."
      ]
    },
    {
      "name": "Meta (Facebook)",
      "position": "Machine Learning Research Scientist",
      "url": "",
      "startDate": "2022-05-01",
      "endDate": "2024-05-01",
      "summary": "Led cutting-edge AI research and development, focusing on the integration of NLP, Computer Vision, and Generative AI to drive advancements in consumer engagement and content personalization. Directed end-to-end initiatives from conceptualization through deployment, consistently enhancing computational efficiency and accuracy across Meta's digital platforms.",
      "highlights": [
        "Developed advanced Vision Transformer (ViT) and SWIN Transformer models, enhancing semantic segmentation accuracy by 7% and achieving a 15% improvement in user engagement metrics.",
        "Successfully deployed Retrieval-Augmented Generation (RAG) systems using Large Language Models (LLMs), significantly improving query relevance and enhancing user satisfaction across various applications.",
        "Increased computational efficiency threefold by implementing techniques like mixed-precision training and model quantization, contributing to a 33% increase in revenue by reducing computational costs and accelerating processing times.",
        "Engineered cross-modal AI systems that seamlessly combined NLP and Computer Vision, advancing Visual Question Answering (VQA) and Image Captioning to enhance multi-modal user interactions.",
        "Spearheaded the deployment of generative AI models for personalized content generation, leveraging diffusion models and transformer-based architectures to elevate user experience across Meta’s platforms.",
        "Optimized model deployment with TorchScript and ONNX, ensuring adaptability and performance across diverse hardware environments while reducing latency in real-time applications.",
        "Built robust data pipelines and managed large-scale data analytics with SQL and BigQuery, directly enhancing data-driven decision-making and model training efficiency."
      ]
    },
    {
      "name": "Huma AI",
      "position": "Senior Data Scientist",
      "url": "",
      "startDate": "2020-06-01",
      "endDate": "2022-05-01",
      "summary": "Specialized in developing and optimizing automated Q&A systems powered by large language models (LLMs) to drive revenue growth and operational efficiency. Led initiatives that leveraged cutting-edge NLP techniques to deliver accurate, responsive answers and streamline workflows, contributing to substantial cost savings and enhanced user experience.",
      "highlights": [
        "Increased answer accuracy by 20% and reduced response latency by 40% by deploying advanced zero-shot learning techniques and clustering methods, significantly improving system responsiveness and accuracy for a diverse range of user queries.",
        "Engineered end-to-end data flow optimizations for the Q&A system, reducing manual labeling costs by 70% through efficient data utilization and automation strategies, resulting in substantial operational cost savings.",
        "Led the integration of AWS services, including SageMaker, for scalable deployment of the Q&A models, enabling reliable and high-performance model management across production environments.",
        "Contributed over $1M in annual revenue through strategic enhancements in model accuracy and system reliability, optimizing the user experience and establishing the Q&A system as a revenue-generating asset for the organization.",
        "Utilized advanced natural language processing frameworks and tools (e.g., Hugging Face, LangChain) to build robust NLP pipelines, improving both model training efficiency and the overall responsiveness of the Q&A system."
      ]
    },
    {
      "name": "Virginia Tech",
      "position": "Graduate Research Assistant",
      "url": "",
      "startDate": "2018-01-01",
      "endDate": "2020-08-01",
      "summary": "Conducted research on privacy-preserving techniques for deep learning, focusing on federated learning in NLP and Computer Vision.",
      "highlights": [
        "Developed privacy enhancement algorithms for large language models."
      ]
    },
    {
      "name": "West Virginia University",
      "position": "Graduate Research Assistant",
      "url": "",
      "startDate": "2016-01-01",
      "endDate": "2017-12-01",
      "summary": "Researched the integration of computer vision and speech technologies for multimodal interaction systems.",
      "highlights": [
        "Engineered a lip-reading system to enhance communication aids for the hearing-impaired."
      ]
    }
  ],
  "education": [
    {
      "institution": "Virginia Polytechnic Institute and State University (Virginia Tech)",
      "location": "Blacksburg, Virginia",
      "url": "",
      "area": "Computer Science",
      "studyType": "PhD",
      "startDate": "",
      "endDate": "",
      "score": "",
      "courses": [
        "Thesis: Synthetic data generation for privacy-preserving deep learning in medical applications."
      ]
    }
  ],
  "awards": [
    {
      "title": "Best Ph.D. Thesis Award",
      "date": "2020-08-15",
      "awarder": "Virginia Tech",
      "url": "",
      "summary": "Awarded for significant contributions to generative AI-driven synthetic data generation for healthcare."
    }
  ],
  "skills": [
  {
    "name": "Machine Learning & AI",
    "level": "Expert",
    "keywords": [
      "Generative AI",
      "Transformers (BERT, GPT-3, T5)",
      "Computer Vision",
      "NLP (Natural Language Processing)",
      "Sequence-to-Sequence Models",
      "Self-Supervised Learning",
      "Zero-Shot Learning",
      "Transfer Learning",
      "Model Optimization & Compression (Quantization, Mixed-Precision)",
      "Federated Learning",
      "Privacy-Preserving ML"
    ]
  },
  {
    "name": "Domain Applications",
    "level": "Expert",
    "keywords": [
      "Medical Imaging",
      "Sports Analytics",
      "AR/VR Applications",
      "E-commerce Personalization",
      "Digital Twins",
      "Human Pose Estimation",
      "Multimodal Interaction Systems",
      "Predictive Modeling",
      "Cluster Analysis"
    ]
  },
  {
    "name": "Frameworks & Tools",
    "level": "Expert",
    "keywords": [
      "TensorFlow",
      "PyTorch",
      "Keras",
      "Hugging Face",
      "LangChain",
      "LlamaIndex",
      "SQL",
      "BigQuery",
      "Docker",
      "AWS SageMaker",
      "Vertex AI (GCP)",
      "TorchScript",
      "ONNX",
      "MLflow",
      "Weights & Biases",
      "Optuna"
    ]
  },
  {
    "name": "Data Processing & Analysis",
    "level": "Expert",
    "keywords": [
      "Data Preprocessing (Normalization, Scaling, Augmentation)",
      "Model Evaluation Metrics (AUC-ROC, F1-score, mIoU)",
      "Advanced Statistical Analysis",
      "Experiment Tracking",
      "A/B Testing",
      "K-Fold Cross-Validation",
      "Hyperparameter Tuning",
      "ETL Pipelines",
      "Data Warehousing (Snowflake, Redshift)"
    ]
  },
  {
    "name": "Programming & Systems",
    "level": "Advanced",
    "keywords": [
      "Python",
      "Shell Scripting",
      "SQL & BigQuery",
      "CI/CD",
      "PostgreSQL",
      "DynamoDB",
      "Elasticsearch",
      "Version Control (Git, Mercurial)",
      "React (Full-Stack Development)"
    ]
  },
  {
    "name": "Cloud & Distributed Computing",
    "level": "Advanced",
    "keywords": [
      "AWS (Lambda, ECR, SageMaker)",
      "GCP (Vertex AI)",
      "Apache Spark",
      "Hadoop",
      "Apache Kafka",
      "Distributed Training"
    ]
  },
  {
    "name": "Visualization & Reporting",
    "level": "Advanced",
    "keywords": [
      "Seaborn",
      "Matplotlib",
      "Plotly",
      "Tableau",
      "Power BI",
      "Dashboard Development",
      "Interactive Visualizations"
    ]
  },
  {
    "name": "Project Management & Collaboration",
    "level": "Advanced",
    "keywords": [
      "Agile Methodologies",
      "Team Leadership & Mentoring",
      "Cross-Functional Collaboration",
      "Slack",
      "JIRA",
      "Confluence",
      "Data Governance",
      "Strategic Planning",
      "Stakeholder Communication"
    ]
  }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Persian",
      "fluency": "Native"
    }
  ],
  "interests": [
  {
    "name": "Machine Learning & Data Science",
    "keywords": [
      "AI Ethics",
      "Data Privacy",
      "Federated Learning",
      "Synthetic Data Generation",
      "Deep Learning Trends",
      "Explainable AI (XAI)",
      "Bias & Fairness in AI",
      "Edge AI",
      "Human-AI Collaboration",
      "Self-Supervised Learning",
      "Reinforcement Learning Applications"
    ]
  },
  {
    "name": "Applications of AI",
    "keywords": [
      "Medical Imaging",
      "Augmented & Virtual Reality (AR/VR)",
      "Personalized User Experiences",
      "Digital Twins",
      "Smart Retail",
      "Environmental Sustainability through AI"
    ]
  },
  {
    "name": "Emerging Technologies",
    "keywords": [
      "Quantum Computing for AI",
      "Neurosymbolic AI",
      "Neuromorphic Computing",
      "Graph Neural Networks",
      "Blockchain for Data Security"
    ]}
  ],
  "projects": [
    {
      "name": "Open Source Projects on GitHub",
      "summary": "A collection of machine learning, computer vision, and NLP projects.",
      "highlights": [
        "Applications in Generative AI",
        "Multi-modal AI",
        "Optimization for real-time systems"
      ],
      "url": "https://github.com/astorfi"
    }
  ]
}
